InformationRegisters/РегламентныеДействияПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РегламентныеДействияПоКатегориям</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентноеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеВнешнихОбработок</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
						<v8:Type>cfg:CatalogRef.РегламентныеДействияПоКатегориям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегламентныеДействияПоКатегориям/Ext/ManagerModule.bsl
Функция ПроверитьВыполнениеСкоринга(КоличествоЧасов) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыСкоринга.Ссылка
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ВидыСкоринга КАК ВидыСкоринга
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентныеДействияПоКатегориям КАК РегламентныеДействияПоКатегориям
	                      |		ПО (РегламентныеДействияПоКатегориям.РегламентноеДействие = ВидыСкоринга.Ссылка)
	                      |ГДЕ
	                      |	ВидыСкоринга.Используется
	                      |	И ЕСТЬNULL(РегламентныеДействияПоКатегориям.ДатаЗавершенияПоследнегоЗапуска, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < &Дата");
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * КоличествоЧасов); 
	Возврат Не Запрос.Выполнить().Выбрать().Следующий();
КонецФункции
